Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC01/svd/PIC32CK1025GC01064.svd
               <register>
                  <name>CALCTRL_FUSES_ADC_SARCORE_12BIT_V7C0_MODE</name>
                  <description>SARCORE Calibration Value</description>
                  <alternateRegister>CALCTRL</alternateRegister>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>en_cmbf</name>
                        <description>Enable Common Mode Buffer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>en_dither</name>
                        <description>Enable Dither</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>dis_faz</name>
                        <description>Disable auto-zeroing</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>dis_saz</name>
                        <description>Disable auto-zeroing</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>dis_laz</name>
                        <description>Disable auto-zeroing</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>en_rdac</name>
                        <description>Disable Power Cycling</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>dbg_sel</name>
                        <description>Debug Bus Select</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>sel_del</name>
                        <description>Scan Mode comp_out</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>t1_dly</name>
                        <description>Regen Latch Delay</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>tclk_div</name>
                        <description>Test Clock Divider</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>iadc_1</name>
                        <description>Current Consumption 1</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>iadc_2</name>
                        <description>Current Consumption 2</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>icmp_1</name>
                        <description>Bias Current Stage 1</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>icmp_2</name>
                        <description>Bias Current Stage 2</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>icmbf</name>
                        <description>Bias Current Common Mode Buffer</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>en_ext_bias</name>
                        <description>Dsiable Internal Bias Circuit</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EVCTRL</name>
                  <description>Event Control</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>STARTEI</name>
                        <description>Start Event conversion input enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STARTINV</name>
                        <description>Start Conversion Invert</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RESRDYEO</name>
                        <description>Result Ready Event Out</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CMPEO</name>
                        <description>Comparator Window Event Out</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>CMPCTRL</name>
               <description>Comparator Control</description>
               <addressOffset>0xB0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADCMPLO</name>
                     <description>Low Limit of Digital Comparator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>CMPEN</name>
                     <description>Comparator Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IELOLO</name>
                     <description>Enable VAL &lt; CMPLO</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IELOHI</name>
                     <description>Enable VAL &gt;= CMPLO</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IEBTWN</name>
                     <description>Enable CMPLO &lt;= VAL &lt; CMPHI</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCMPHI</name>
                     <description>High Limit of Digital Comparator</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>IEHILO</name>
                     <description>Enable VAL &lt; CMPHI</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IEHIHI</name>
                     <description>Enable VAL &gt;= CMPHI</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLTCTRL</name>
               <description>Filter Control</description>
               <addressOffset>0xC0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OVRSAM</name>
                     <description>Oversampling Ratio</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>OVRSAMSelect</name>
                        <enumeratedValue>
                           <name>4_SAMPLES</name>
                           <description>(If FMODE is 0) 4 samples (shift sum 1 bit to right, output data is 13-bits) / (If FMODE is 1) 2 samples to be averaged</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16_SAMPLES</name>
                           <description>(If FMODE is 0) 16 samples (shift sum 2 bits to right, output data is 14-bits) / (If FMODE is 1) 4 samples to be averaged</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>64_SAMPLES</name>
                           <description>(If FMODE is 0) 64 samples (shift sum 3 bits to right, output data is 15-bits) / (If FMODE is 1) 8 samples to be averaged</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>256_SAMPLES</name>
                           <description>(If FMODE is 0) 256 samples (shift sum 4 bits to right, output data is 16-bits) / (If FMODE is 1) 16 samples to be averaged</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2_SAMPLES</name>
                           <description>(If FMODE is 0) 2 samples (shift sum 0 bits to right, output data is 12.1 format) / (If FMODE is 1) 32 samples to be averaged</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8_SAMPLES</name>
                           <description>(If FMODE is 0) 8 samples (shift sum 1 bit to right, output data is 13.1 format) / (If FMODE is 1) 64 samples to be averaged</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32_SAMPLES</name>
                           <description>(If FMODE is 0) 32 samples (shift sum 2 bits to right, output data is 14.1 format) / (If FMODE is 1) 128 samples to be averaged</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>128_SAMPLES</name>
                           <description>(If FMODE is 0) 128 samples (shift sum 3 bits to right, output data is 15.1 format) / (If FMODE is 1) 256 samples to be averaged</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FMODE</name>
                     <description>Filter Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATA16EN</name>
                     <description>16bit Averaging Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLTEN</name>
                     <description>Filter Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLTCHNID</name>
                     <description>Channel ID</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CORCHDATAID</name>
               <description>Channel Ready DATA ID</description>
               <addressOffset>0xD0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHRDYID</name>
                     <description>Channel Read ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CORDYID</name>
                     <description>Core Read ID</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHRDYDAT</name>
               <description>Channel Ready Data Register</description>
               <addressOffset>0xD4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHRDYDAT</name>
                     <description>Channel Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>LVL</name>
                     <description>Level Setting</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF</name>
                     <description>Differential Setting</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIGN</name>
                     <description>Sign Setting</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRACT</name>
                     <description>Fractional Setting</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PFFDATA</name>
               <description>APB FIFO Output Data</description>
               <addressOffset>0xD8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PFFDATA</name>
                     <description>SARCORE Conversion data from the APB FIFO</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PFFCHNID</name>
                     <description>Channel ID from APB FIFO</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PFFCORID</name>
                     <description>Core ID from APB FIFO</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PFFSIGN</name>
                     <description>Channel Sign from the APB FIFO</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFFFRACT</name>
                     <description>Fractional Setting from APB FIFO</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFFCNT</name>
                     <description>Current Data Entries in APB FIFO</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMABASE</name>
               <description>DMA Sample Base Address</description>
               <addressOffset>0xDC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMABASE</name>
                     <description>DMA Sample Value Base Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMACTRL</name>
               <description>DMA Control Register</description>
               <addressOffset>0xE0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMAEN</name>
                     <description>DMA Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMACR</name>
                     <description>DMA CORE Enables</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DMABL</name>
                     <description>DMA System RAM Buffer Length</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PFFCTRL</name>
               <description>APB FIFO Control Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PFFEN</name>
                     <description>APB FIFO Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFFCR</name>
                     <description>APB CORE FIFO Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PFFRDYDM</name>
                     <description>DMA APB FIFO Data Ready</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PFFRDYDMSelect</name>
                        <enumeratedValue>
                           <name>CTLINTFLAG_PFFHFUL</name>
                           <description>Selects CTLINTFLAG.PFFHFUL for the ADC DMA PFFRDY trigger signal to the DMAC</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTLINTFLAG_PFFRDY</name>
                           <description>Selects CTLINTFLAG.PFFRDY for the ADC DMA PFFRDY trigger signal to the DMAC</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>CORE SYNC Busy Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Sync Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable bit Sync Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTRLB</name>
                     <description>CTRLB sync busy</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMAINTENCLR</name>
               <description>DMA Interrupt Enable Clear</description>
               <addressOffset>0xF0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RAF</name>
                     <description>Ram Buffer A Full</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RBF</name>
                     <description>Ram Buffer B Full</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SOVFL</name>
                     <description>Synchonizer Overflow</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
