Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC01/svd/PIC32CK1025GC01064.svd
            <register>
               <name>WEXCTRL</name>
               <description>Waveform Extension Configuration</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OTMX</name>
                     <description>Output Matrix</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTIEN0</name>
                     <description>Dead-time Insertion Generator 0 Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTIEN1</name>
                     <description>Dead-time Insertion Generator 1 Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTIEN2</name>
                     <description>Dead-time Insertion Generator 2 Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTIEN3</name>
                     <description>Dead-time Insertion Generator 3 Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTLS</name>
                     <description>Dead-time Low Side Outputs Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DTHS</name>
                     <description>Dead-time High Side Outputs Value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DRVCTRL</name>
               <description>Driver Control</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NRE0</name>
                     <description>Non-Recoverable State 0 Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRE1</name>
                     <description>Non-Recoverable State 1 Output Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRE2</name>
                     <description>Non-Recoverable State 2 Output Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRE3</name>
                     <description>Non-Recoverable State 3 Output Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRE4</name>
                     <description>Non-Recoverable State 4 Output Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRE5</name>
                     <description>Non-Recoverable State 5 Output Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRE6</name>
                     <description>Non-Recoverable State 6 Output Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRE7</name>
                     <description>Non-Recoverable State 7 Output Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV0</name>
                     <description>Non-Recoverable State 0 Output Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV1</name>
                     <description>Non-Recoverable State 1 Output Value</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV2</name>
                     <description>Non-Recoverable State 2 Output Value</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV3</name>
                     <description>Non-Recoverable State 3 Output Value</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV4</name>
                     <description>Non-Recoverable State 4 Output Value</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV5</name>
                     <description>Non-Recoverable State 5 Output Value</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV6</name>
                     <description>Non-Recoverable State 6 Output Value</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV7</name>
                     <description>Non-Recoverable State 7 Output Value</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN0</name>
                     <description>Output Waveform 0 Inversion</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN1</name>
                     <description>Output Waveform 1 Inversion</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN2</name>
                     <description>Output Waveform 2 Inversion</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN3</name>
                     <description>Output Waveform 3 Inversion</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN4</name>
                     <description>Output Waveform 4 Inversion</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN5</name>
                     <description>Output Waveform 5 Inversion</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN6</name>
                     <description>Output Waveform 6 Inversion</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN7</name>
                     <description>Output Waveform 7 Inversion</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FILTERVAL0</name>
                     <description>Non-Recoverable Fault Input 0 Filter Value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FILTERVAL1</name>
                     <description>Non-Recoverable Fault Input 1 Filter Value</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control</description>
               <addressOffset>0x1E</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DBGRUN</name>
                     <description>Debug Running Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FDDBD</name>
                     <description>Fault Detection on Debug Break Detection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EVACT0</name>
                     <description>Timer/counter Input Event0 Action</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>EVACT0Select</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Event action disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RETRIGGER</name>
                           <description>Start, restart or re-trigger counter on event</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COUNTEV</name>
                           <description>Count on event</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>START</name>
                           <description>Start counter on event</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INC</name>
                           <description>Increment counter on event</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COUNT</name>
                           <description>Count on active state of asynchronous event</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STAMP</name>
                           <description>Stamp capture</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FAULT</name>
                           <description>Non-recoverable fault</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EVACT1</name>
                     <description>Timer/counter Input Event1 Action</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>EVACT1Select</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Event action disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RETRIGGER</name>
                           <description>Re-trigger counter on event</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIR</name>
                           <description>Direction control</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>Stop counter on event</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DEC</name>
                           <description>Decrement counter on event</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWP</name>
                           <description>Period capture value in CC1 register, pulse width capture value in CC0 register</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FAULT</name>
                           <description>Non-recoverable fault</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CNTSEL</name>
                     <description>Timer/counter Output Event Mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CNTSELSelect</name>
                        <enumeratedValue>
                           <name>START</name>
                           <description>An interrupt/event is generated when a new counter cycle starts</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>END</name>
                           <description>An interrupt/event is generated when a counter cycle ends</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOUNDARY</name>
                           <description>An interrupt/event is generated when a new counter cycle starts or a counter cycle ends</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OVFEO</name>
                     <description>Overflow/Underflow Output Event Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRGEO</name>
                     <description>Retrigger Output Event Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNTEO</name>
                     <description>Timer/counter Output Event Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCINV0</name>
                     <description>Inverted Event 0 Input Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCINV1</name>
                     <description>Inverted Event 1 Input Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCEI0</name>
                     <description>Timer/counter Event 0 Input Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCEI1</name>
                     <description>Timer/counter Event 1 Input Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEI0</name>
                     <description>Match or Capture Channel 0 Event Input Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEI1</name>
                     <description>Match or Capture Channel 1 Event Input Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEI2</name>
                     <description>Match or Capture Channel 2 Event Input Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEI3</name>
                     <description>Match or Capture Channel 3 Event Input Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEI4</name>
                     <description>Match or Capture Channel 4 Event Input Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEI5</name>
                     <description>Match or Capture Channel 5 Event Input Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEO0</name>
                     <description>Match or Capture Channel 0 Event Output Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEO1</name>
                     <description>Match or Capture Channel 1 Event Output Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEO2</name>
                     <description>Match or Capture Channel 2 Event Output Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEO3</name>
                     <description>Match or Capture Channel 3 Event Output Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEO4</name>
                     <description>Match or Capture Channel 4 Event Output Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEO5</name>
                     <description>Match or Capture Channel 5 Event Output Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
